

let questionBank = [

{
passage:`
昨晚張太太的肚子很痛，感覺小孩快要生出來了，
所以她<b>..1..</b>送進了醫院。張先生也<b>..2..</b>張太太到醫院去，
他又高興又緊張，因為他就要<b>..3..</b>爸爸了。
五個小時以後，小孩生出來了，是一個可愛的小女生。
張先生和張太太<b>..4..</b>這個孩子想了一個名字，
叫「張美樂」，<b>..5..</b>她將來「美麗」又「快樂」。
`,

questions:[

{
options:["把","能","被","會"],
answer:2
},

{
options:["幫","害","陪","請"],
answer:2
},

{
options:["當","成","裝","弄"],
answer:0
},

{
options:["教","為","讓","養"],
answer:1
},

{
options:["覺得","要求","決定","希望"],
answer:3
}

]

},
{
passage:`
和小李是大學<b>..1..</b>的好朋友，大學畢業以後，他們已經<b>..2..</b>年沒見面了。
有一次小陳<b>..3..</b>想起和小李一起讀書的事，他
很想知道小李現在過得怎麼樣，所以他找出小李以前寄給他的信，
<b>..4..</b>著信上的地址去找小李。可是小李的鄰居說小李一家人早就
搬家了，小陳很難過，因為他<b>..5..</b>以後都見不到小李了
`,

questions:[

{
options:["時代","時間","年級","年紀"],
answer:0
},

{
options:["多久","好幾","很長","很久"],
answer:1
},

{
options:["忽然","總是","隨時","從來"],
answer:0
},

{
options:["跟","接","寫","照"],
answer:3
},

{
options:["能夠","只有","可能","要是"],
answer:2
}

]

},
{
passage:`
王小姐喜歡跳舞，她認為讓身體隨著音樂擺動不是一件困難的
事，所以<b>..1..</b>是老人還是小孩， <b>..1..</b>可以將跳舞當作規律的運
動。王小姐平時的工作壓力很大，她利用跳舞， <b>..2..</b>自己的壓力，
忘掉工作上的不愉快。<b>..3..</b>三年的跳舞運動，她的身體更加健康，
她還參加舞蹈比賽，<b>..4..</b>冠軍。她熱愛跳舞，<b>..5..</b>工作再怎麼忙，
她還是會到舞蹈教室報到。
`,

questions:[

{
options:["不論…都…","不但…也…","雖然…但是…","由於…因此…"],
answer:0
},

{
options:["防止","縮短","減輕","缺少"],
answer:2
},

{
options:["根據","經過","按照","至於"],
answer:1
},

{
options:["得到","受到","接到","收到"],
answer:0
},

{
options:["否則","另外","免得","就算"],
answer:3
}

]

},

{
text:`上星期小明第一次到韓國旅遊。他在那兒玩了五天四夜，其中一天，他去了韓國最高的山，
那時候山上下起了雪，他覺得這樣的風景真美。大部分的時間，他坐電車到幾個大城市去參觀
有名的地方，也吃了不少味道特別的韓國菜。小明覺得韓國很好玩，他打算學習韓國的語言，
以後有機會的話，他想到韓國讀書。
<br></br>
<b>下面哪一個是<u>對的</u></b>`,

options:[
"小明已經去過韓國兩次了",
"小明想學習怎麼做韓國菜",
"小明覺得韓國不怎麼好玩",
"小明在韓國住了四個晚上"
],

answer:3
},

{
text:`孩子，這是你改搭校車回家的第一天。媽媽沒忘記你早上出門前，
不停地告訴我搭校車是件很恐怖的事，那語氣裡充滿了面對不確
定的不安，更讓媽媽覺得不忍心。然而我只是笑著看你，聽你把所有
預期中可怕的後果全部說完，然後篤定地告訴你：「這是你人生的另
一個開始，你要學著去面對你自己的人生！」
<br></br>
<b> 在這段短文裡，母親面對孩子的不安時，態度怎麼樣？</b>`,

options:[
"既害怕又不忍心",
"不知道該怎麼辦",
"覺得孩子很可憐",
"鼓勵孩子自己解決"
],

answer:3
},

{
text:`今天下午小英在圖書館看了一部電影，這部電影叫做「旅館主
人」，講的是一個人怎麼成功的故事。電影中的人本來是一個只有小
學畢業、沒有工作、身上只剩一百塊錢的人，後來卻變成一家旅館的
老闆。旅館的生意非常好，所以他變得很有錢。這原來是一本小說的
故事，因為這本小說寫得很棒，就被拍成電影了。小英覺得這部電影
拍得很好，也聽說小說寫得不錯，之後想看看小說和電影的故事內容
是不是一樣的。
<br></br>
<b>「旅館主人」講的是什麼故事？</b>`,

options:[
"一個旅館老闆變成沒有工作的人",
"一個只有小學畢業的人，變成旅館老闆",
"一個沒有工作的人，變成旅館的服務生",
"一個本來很有錢，後來身上只剩一百塊錢的人"
],

answer:1
},

{
text:`今天下午小英在圖書館看了一部電影，這部電影叫做「旅館主
人」，講的是一個人怎麼成功的故事。電影中的人本來是一個只有小
學畢業、沒有工作、身上只剩一百塊錢的人，後來卻變成一家旅館的
老闆。旅館的生意非常好，所以他變得很有錢。這原來是一本小說的
故事，因為這本小說寫得很棒，就被拍成電影了。小英覺得這部電影
拍得很好，也聽說小說寫得不錯，之後想看看小說和電影的故事內容
是不是一樣的。
<br></br>
<b> 下面哪一個是<u>錯的？</u></b>`,

options:[
"小英還沒看過「旅館主人」的小說",
"「旅館主人」是小英在圖書館看的電影",
"小英認為「旅館主人」這部電影拍得不錯",
"小英覺得「旅館主人」的小說和電影沒什麼不同"
],

answer:3
},

{
text:`在我的國家，每年都有颱風，颱風有的大，有的小。如果來的是
大颱風，對我們的生活就有嚴重的影響。今年八月有個大颱風，下大
雨、吹大風，火車沒辦法開，飛機停飛，所有人不上班、不上課，大
部分的人不敢出去，只能在家看颱風的新聞。好不容易等到颱風離
開，很多屋子卻都進水了，許多樹、房子被吹倒了，連橋也被大水沖
壞了。聽說這個週末又有一個颱風要來，真希望它是個小颱風。
<br></br>
<b>這段文章主要在說什麼？</b>`,

options:[
"颱風季節都是在八月",
"大颱風對人們生活的影響",
"如果颱風來，要準備的東西",
"如果小颱風來，會發生的事情"
],

answer:1
},

{
text:`在我的國家，每年都有颱風，颱風有的大，有的小。如果來的是
大颱風，對我們的生活就有嚴重的影響。今年八月有個大颱風，下大
雨、吹大風，火車沒辦法開，飛機停飛，所有人不上班、不上課，大
部分的人不敢出去，只能在家看颱風的新聞。好不容易等到颱風離
開，很多屋子卻都進水了，許多樹、房子被吹倒了，連橋也被大水沖
壞了。聽說這個週末又有一個颱風要來，真希望它是個小颱風。
<br></br>
<b>下面哪一個是錯的？</b>`,

options:[
"今年八月的颱風雨下得很大",
"大颱風來的時候，火車停開",
"因為這個大颱風，許多房子倒了",
"雖然大颱風來，還是要繼續上班"
],

answer:3
},

{
text:`大部分的商品廣告不會告訴你事實。相對地，他們想要為你創造
出一個形象，例如快樂的家庭、令人興奮的愛情、美麗的身材等。廣
告會針對不同的年齡層、不同的對象，設計出不同的廣告內容，例如
電腦廣告呈現的是事業成功的人，慢跑鞋廣告呈現的是強壯而健康的
運動員。「形象」通常比任何和產品有關的資訊還要重要，例如啤酒
廣告絕不會呈現出酒醉駕駛發生車禍的情形，相反地，廣告中呈現的
是人們歡樂的景象。因此廣告希望傳遞給我們的訊息是：試試我們的
產品，你就能擁有你想要的形象。
<br></br>
<b>這篇文章主要在說什麼？</b>
`,

options:[
"廣告說的都是事實",
"拍廣告的費用很高",
"廣告能創造美好形象",
"每個商品都需要廣告"
],

answer:2
},

{
text:`大部分的商品廣告不會告訴你事實。相對地，他們想要為你創造
出一個形象，例如快樂的家庭、令人興奮的愛情、美麗的身材等。廣
告會針對不同的年齡層、不同的對象，設計出不同的廣告內容，例如
電腦廣告呈現的是事業成功的人，慢跑鞋廣告呈現的是強壯而健康的
運動員。「形象」通常比任何和產品有關的資訊還要重要，例如啤酒
廣告絕不會呈現出酒醉駕駛發生車禍的情形，相反地，廣告中呈現的
是人們歡樂的景象。因此廣告希望傳遞給我們的訊息是：試試我們的
產品，你就能擁有你想要的形象。
<br></br>
<b> 根據這篇文章，下面哪一個是<u>對的？</u></b>
`,

options:[
"產品資訊比形象更重要",
"廣告內容沒有年紀的分別",
"廣告會針對特定對象設計內容",
"廣告把一切使用後的結果告訴你"
],

answer:2
},

{
image:"images/qq.png",

text:`
<b>關於這四個廣告，下面哪一個是<u>對的？</u></b>
`,

options:[
"A. 這四個廣告都是賣電腦的",
"B. 小陳賣的電腦用了一年了",
"C. 李小姐的電腦要賣 9500 元",
"D. 早上九點可以打電話給小陳"
],

answer:1
},

{
image:"images/qq.png",

text:`
<b>如果你想要買新電腦，應該找誰？</b>
`,

options:[
"A. 小陳",
"B. 李小姐",
"C. 王先生",
"D. 林先生"
],

answer:2
},
{
image:"images/q2.png",

text:`
<b>這封信說了小美的什麼事？</b>
`,

options:[
"A. 她決定出國念書",
"B. 她來美國已經兩年了",
"C. 她男朋友找到了新工作",
"D.下週五晚上，她的學校有活動"
],

answer:2
},
{
image:"images/q2.png",

text:`
<b>關於這封信，下面哪一個不對？</b>
`,

options:[
"A. 小美本來打算出國念書",
"B. 明真希望小美參加學校晚會",
"C. 明真先收到了一封小美寄來的信",
"D. 小美想知道大忠的工作做得好不好"
],

answer:3
},
{
image:"images/q3.png",

text:`
<b>這是心美的記事本，下面哪一個不對？</b>
`,

options:[
"A. 心美星期四有會議",
"B. 心美週末要看電影",
"C. 心美星期二上數學課",
"D. 心美打算送禮物給小英"
],

answer:2
},
{
image:"images/q3.png",

text:`
<b>心美哪幾天要上班？</b>
`,

options:[
"A. 星期日和星期一",
"B. 星期一和星期二",
"C. 星期四和星期五",
"D. 星期五和星期一"
],

answer:3
},
{
image:"images/q4.png",

text:`
<b>這個自助加油機要怎麼使用？</b>
`,

options:[
"A. 拿到發票以後再付錢",
"B. 加完油以後，才能拿回信用卡",
"C. 當機器有問題的時候，按「F1」",
"D. 油槍放入油箱後，再按「開始」"
],

answer:3
},
{
image:"images/q4.png",

text:`
<b>客人使用這個機器的時候，可以做哪件事？</b>
`,

options:[
"A. 坐在車裡讓人服務",
"B. 找服務員解決問題",
"C. 讓 15 歲的學生使用",
"D. 一邊打手機，一邊加油"
],

answer:1
},
{
image:"images/q5.png",

text:`
<b>關於這個產品，下面哪一個是對的？</b>
`,

options:[
"A. 是在台北市製造的",
"B. 打開後不必放進冰箱",
"C. 不能放在陽光照得到的地方",
"D. 放到 2010 年 1 月 1 日就過期了"
],

answer:2
},
{
image:"images/q5.png",

text:`
<b>根據說明，如果覺得這個產品吃起來味道怪怪的，該怎麼做？</b>
`,

options:[
"A. 寫信給這家公司",
"B. 打電話給這家公司",
"C. 把產品寄給這家公司",
"D. 請這家公司來收這個產品"
],

answer:2
},
{
image:"images/q6.png",

text:`
<b>下面哪一個是對的？</b>
`,

options:[
"A. 大衛想要一個空房間",
"B. 這家飯店只有兩個空房間",
"C. 這家飯店還不知道大衛的決定",
"D. 兩個空房間一個晚上要 3200 元"
],

answer:2
},
{
image:"images/q6.png",

text:`
<b>如果大衛想要住這家飯店，他可以在什麼時候打電話給飯店？</b>
`,

options:[
"A. 12/21 早上八點",
"B. 12/21 晚上十點",
"C. 12/22 早上七點",
"D. 12/22 晚上九點"
],

answer:3
},
{
image:"images/q7.png",

text:`
<b>下面哪一種作品符合這個報社的需要？</b>
`,

options:[
"A. 長篇小說",
"B. 本地名人介紹",
"C. 歷史電影的劇本",
"D. 自己設計的笑話"
],

answer:1
},
{
image:"images/q7.png",

text:`
<b>根據這段說明，下面哪一個正確？</b>
`,

options:[
"A. 故事可以自編",
"B. 故事愈長，稿酬愈多",
"C. 如果被採用，版權不是作者的",
"D. 如果沒被採用，就會退還給作者"
],

answer:2
},

{
text:`信用卡雖然很方便，但是不小心的話，一下子就會花掉很多錢，
所以現在還不了錢的人越來越多。像是奇美，她用信用卡買了太多東
西，結果沒辦法還錢，所以必須同時做三份工作，把賺來的錢全部還
給銀行。會出現這樣的問題，主要是因為使用信用卡的人常常沒
什麼錢卻買很多東西，而且還會不清楚自己花了多少錢；另一
個原因是，現在的銀行對使用者的要求越來越低，連沒有工作
的學生也能申請信用卡，對還錢的方式一開始也說得不清楚。
結果這張給人方便的卡片也給人們帶來了很大的麻煩。
<br></br>
<b> 這段文章主要在說什麼？</b>
`,

options:[
"什麼人可以使用信用卡",
"怎麼使用信用卡買東西",
"使用信用卡後怎麼還錢",
"使用信用卡後發生的問題"
],

answer:3
},
{
text:`信用卡雖然很方便，但是不小心的話，一下子就會花掉很多錢，
所以現在還不了錢的人越來越多。像是奇美，她用信用卡買了太多東
西，結果沒辦法還錢，所以必須同時做三份工作，把賺來的錢全部還
給銀行。會出現這樣的問題，主要是因為使用信用卡的人常常沒
什麼錢卻買很多東西，而且還會不清楚自己花了多少錢；另一
個原因是，現在的銀行對使用者的要求越來越低，連沒有工作
的學生也能申請信用卡，對還錢的方式一開始也說得不清楚。
結果這張給人方便的卡片也給人們帶來了很大的麻煩。
<br></br>
<b> 奇美為什麼要做三份工作？</b>
`,

options:[
"她還想買更多東西",
"她要買很貴的東西",
"她必須還錢給銀行",
"她想多放點錢在銀行"
],

answer:2
},
{
text:`信用卡雖然很方便，但是不小心的話，一下子就會花掉很多錢，
所以現在還不了錢的人越來越多。像是奇美，她用信用卡買了太多東
西，結果沒辦法還錢，所以必須同時做三份工作，把賺來的錢全部還
給銀行。會出現這樣的問題，主要是因為使用信用卡的人常常沒
什麼錢卻買很多東西，而且還會不清楚自己花了多少錢；另一
個原因是，現在的銀行對使用者的要求越來越低，連沒有工作
的學生也能申請信用卡，對還錢的方式一開始也說得不清楚。
結果這張給人方便的卡片也給人們帶來了很大的麻煩。
<br></br>
<b>還不了信用卡費用的原因有很多，下面哪一個不是這段文章提到
的原因？</b>
`,

options:[
"有些人有太多張信用卡",
"銀行沒有把還錢方式說清楚",
"有些人沒注意自己花了很多錢",
"有些人買了太多東西，錢卻不夠"
],

answer:0
},
{
text:`柯林斯夫婦是美國人，有一次他們去中國旅遊，住在一間老舊的
旅館。到達旅館的時候，服務人員對他們說：「我必須告訴你們，你
們要住進去的那個房間裡有喜歡說英文的中國鬼。」雖然柯林斯夫婦
覺得很可怕，但是因為旅館的所有房間都被訂了，想要換旅館也太晚
了，於是，他們仍然住進了那個房間。
 睡到半夜的時候，柯林斯先生聽到奇怪的聲音。他把在睡夢中的
太太搖醒，對她說：「那個中國鬼出現了。既然妳的中文比我好，妳
去請他離開好不好？」他太太回答：「好吧！」柯林斯太太便起床看
看那個中國鬼在哪裡。幾分鐘之後，她回到丈夫身邊說：「那個中國
鬼不喜歡跟我講中文，倒是比較想跟你練習英文，他要你去跟他說
話。」
<br></br>
<b>為什麼柯林斯夫婦不換房間？</b>
`,

options:[
"旅館沒有空房了",
"他們覺得換房間麻煩",
"他們想知道鬼的樣子",
"原本的房間非常舒服"
],

answer:0
},
{
text:`柯林斯夫婦是美國人，有一次他們去中國旅遊，住在一間老舊的
旅館。到達旅館的時候，服務人員對他們說：「我必須告訴你們，你
們要住進去的那個房間裡有喜歡說英文的中國鬼。」雖然柯林斯夫婦
覺得很可怕，但是因為旅館的所有房間都被訂了，想要換旅館也太晚
了，於是，他們仍然住進了那個房間。
 睡到半夜的時候，柯林斯先生聽到奇怪的聲音。他把在睡夢中的
太太搖醒，對她說：「那個中國鬼出現了。既然妳的中文比我好，妳
去請他離開好不好？」他太太回答：「好吧！」柯林斯太太便起床看
看那個中國鬼在哪裡。幾分鐘之後，她回到丈夫身邊說：「那個中國
鬼不喜歡跟我講中文，倒是比較想跟你練習英文，他要你去跟他說
話。」
<br></br>
<b>為什麼柯林斯先生把太太叫醒？</b>
`,

options:[
"鬼來找他說話",
"他覺得鬼來了",
"服務生來找他們",
"他想和太太聊天"
],

answer:1
},
{
text:`柯林斯夫婦是美國人，有一次他們去中國旅遊，住在一間老舊的
旅館。到達旅館的時候，服務人員對他們說：「我必須告訴你們，你
們要住進去的那個房間裡有喜歡說英文的中國鬼。」雖然柯林斯夫婦
覺得很可怕，但是因為旅館的所有房間都被訂了，想要換旅館也太晚
了，於是，他們仍然住進了那個房間。
 睡到半夜的時候，柯林斯先生聽到奇怪的聲音。他把在睡夢中的
太太搖醒，對她說：「那個中國鬼出現了。既然妳的中文比我好，妳
去請他離開好不好？」他太太回答：「好吧！」柯林斯太太便起床看
看那個中國鬼在哪裡。幾分鐘之後，她回到丈夫身邊說：「那個中國
鬼不喜歡跟我講中文，倒是比較想跟你練習英文，他要你去跟他說
話。」
<br></br>
<b>下面哪一個是錯的？</b>
`,

options:[
"鬼想和柯林斯太太說英文",
"柯林斯先生感覺到鬼的存在",
"柯林斯夫婦住進有鬼的房間",
"服務員告訴柯林斯夫婦房間裡有鬼"
],

answer:0
},
//44
{
text:`許多專家都研究夢，他們相信如果我們了解自己的夢，就能了解
自我。夢充滿了有趣的資訊，但是我們必須正視我們所做的夢。簡單
地說，夢讓我們想起白天所錯過的事物，有時候我們太忙而記不得許
多在工作上或生活中所發生的事，做夢時，我們就會用不同的方式記
憶這些事。比方說，人們夢見在重要的約會遲到，這可能是在提醒你
某個約會即將到來，而你卻忘了記下來。另外，有些人夢見牙齒掉了，
這可能是因為他們開始感覺自己年紀越來越老。
<br></br>
就深層的一面來說，夢可以告訴我們自己對於人與人之間關係的
真正看法。舉個例子來說，一位年輕婦女相信她的婚姻是幸福的，但
是晚上卻夢到自己殺了丈夫。這個夢顯示，她得和丈夫溝通了，她必
須要把對丈夫的不滿及憤怒告訴他。現實生活中，她的先生堅持要她
待在家裡而不讓她去找工作，這件事的確讓這位婦女心裡不舒服，所
以她才做了可怕的夢。
<br></br>
<b>這篇文章主要在說什麼？</b>
`,

options:[
"夢的分類方式",
"做夢表示人睡不好",
"影響做夢的大腦器官",
"夢可以幫助人們了解自己"
],

answer:3
},
{
text:`許多專家都研究夢，他們相信如果我們了解自己的夢，就能了解
自我。夢充滿了有趣的資訊，但是我們必須正視我們所做的夢。簡單
地說，夢讓我們想起白天所錯過的事物，有時候我們太忙而記不得許
多在工作上或生活中所發生的事，做夢時，我們就會用不同的方式記
憶這些事。比方說，人們夢見在重要的約會遲到，這可能是在提醒你
某個約會即將到來，而你卻忘了記下來。另外，有些人夢見牙齒掉了，
這可能是因為他們開始感覺自己年紀越來越老。
<br></br>
就深層的一面來說，夢可以告訴我們自己對於人與人之間關係的
真正看法。舉個例子來說，一位年輕婦女相信她的婚姻是幸福的，但
是晚上卻夢到自己殺了丈夫。這個夢顯示，她得和丈夫溝通了，她必
須要把對丈夫的不滿及憤怒告訴他。現實生活中，她的先生堅持要她
待在家裡而不讓她去找工作，這件事的確讓這位婦女心裡不舒服，所
以她才做了可怕的夢。
<br></br>
<b>根據第一段，如果一個人夢到自己約會遲到了，可能表示什麼？</b>
`,

options:[
"他沒有任何約會",
"他錯過了一次約會",
"他不想去這個約會",
"他忘記有個約會快到了"
],

answer:3
},
{
text:`許多專家都研究夢，他們相信如果我們了解自己的夢，就能了解
自我。夢充滿了有趣的資訊，但是我們必須正視我們所做的夢。簡單
地說，夢讓我們想起白天所錯過的事物，有時候我們太忙而記不得許
多在工作上或生活中所發生的事，做夢時，我們就會用不同的方式記
憶這些事。比方說，人們夢見在重要的約會遲到，這可能是在提醒你
某個約會即將到來，而你卻忘了記下來。另外，有些人夢見牙齒掉了，
這可能是因為他們開始感覺自己年紀越來越老。
<br></br>
就深層的一面來說，夢可以告訴我們自己對於人與人之間關係的
真正看法。舉個例子來說，一位年輕婦女相信她的婚姻是幸福的，但
是晚上卻夢到自己殺了丈夫。這個夢顯示，她得和丈夫溝通了，她必
須要把對丈夫的不滿及憤怒告訴他。現實生活中，她的先生堅持要她
待在家裡而不讓她去找工作，這件事的確讓這位婦女心裡不舒服，所
以她才做了可怕的夢。
<br></br>
<b>第二段提到一位婦女所做的夢，作者認為這個夢有什麼意義？</b>
`,

options:[
"她生丈夫的氣",
"她的丈夫死了",
"她想和丈夫離婚",
"她和丈夫過得很快樂"
],

answer:0
},
{
text:`有一首歌，歌名叫「煩」，已流行一段時間，其中有二句是「煩
到無法呼吸，煩到沒有力氣」，話說回來，人生真的這麼煩嗎？事實
上，每個人都有煩惱，可是為什麼我們的腦袋裡裝了那麼多煩惱？那
是因為我們把事情看得太嚴重了，如果我們都能以平常心去看事情，
去接受這個世界的好與壞，我們就會發現煩惱並沒有什麼了不起。
<br></br>
解決煩惱的第一步，就是消除一切消極的想法，把不安、抱怨、
不樂觀、不感興趣、後悔、無信心、緊張、灰心等想法全部丟到腦外，
不要去想它；第二是積極參加各式各樣的戶外活動，例如登山、郊外
旅遊、攝影、露營、看球賽、游泳、看電影等，多和別人聊天，向朋
友訴說心事，聽聽別人意見；最後則是維持正常的生活時間表，讓生
活規律，並且多利用時間運動，保持充分的體力與活力。
<br></br>
有一句話說「天塌下來，都有人撐著」，就是告訴我們不要自己
尋找煩惱，不管發生什麼事，都一定有辦法度過，讓自己過得快樂一
點兒比較重要。

<br></br>
<b>這篇文章主要說明哪件事？</b>
`,

options:[
"如何消除煩惱",
"人有哪些煩惱",
"煩惱對健康的影響",
"容易產生煩惱的原因"
],

answer:0
},
{
text:`有一首歌，歌名叫「煩」，已流行一段時間，其中有二句是「煩
到無法呼吸，煩到沒有力氣」，話說回來，人生真的這麼煩嗎？事實
上，每個人都有煩惱，可是為什麼我們的腦袋裡裝了那麼多煩惱？那
是因為我們把事情看得太嚴重了，如果我們都能以平常心去看事情，
去接受這個世界的好與壞，我們就會發現煩惱並沒有什麼了不起。
<br></br>
解決煩惱的第一步，就是消除一切消極的想法，把不安、抱怨、
不樂觀、不感興趣、後悔、無信心、緊張、灰心等想法全部丟到腦外，
不要去想它；第二是積極參加各式各樣的戶外活動，例如登山、郊外
旅遊、攝影、露營、看球賽、游泳、看電影等，多和別人聊天，向朋
友訴說心事，聽聽別人意見；最後則是維持正常的生活時間表，讓生
活規律，並且多利用時間運動，保持充分的體力與活力。
<br></br>
有一句話說「天塌下來，都有人撐著」，就是告訴我們不要自己
尋找煩惱，不管發生什麼事，都一定有辦法度過，讓自己過得快樂一
點兒比較重要。

<br></br>
<b>作者認為煩惱是如何引起的？/b>
`,

options:[
"與壞朋友來往",
"太在乎每件事",
"受小時候的環境影響",
"社會競爭的壓力太大"
],

answer:1
},
{
text:`有一首歌，歌名叫「煩」，已流行一段時間，其中有二句是「煩
到無法呼吸，煩到沒有力氣」，話說回來，人生真的這麼煩嗎？事實
上，每個人都有煩惱，可是為什麼我們的腦袋裡裝了那麼多煩惱？那
是因為我們把事情看得太嚴重了，如果我們都能以平常心去看事情，
去接受這個世界的好與壞，我們就會發現煩惱並沒有什麼了不起。
<br></br>
解決煩惱的第一步，就是消除一切消極的想法，把不安、抱怨、
不樂觀、不感興趣、後悔、無信心、緊張、灰心等想法全部丟到腦外，
不要去想它；第二是積極參加各式各樣的戶外活動，例如登山、郊外
旅遊、攝影、露營、看球賽、游泳、看電影等，多和別人聊天，向朋
友訴說心事，聽聽別人意見；最後則是維持正常的生活時間表，讓生
活規律，並且多利用時間運動，保持充分的體力與活力。
<br></br>
有一句話說「天塌下來，都有人撐著」，就是告訴我們不要自己
尋找煩惱，不管發生什麼事，都一定有辦法度過，讓自己過得快樂一
點兒比較重要。

<br></br>
<b>關於消除煩惱的方法，哪一項不是這篇文章提到的？</b>
`,

options:[
"找朋友一起喝酒",
"丟掉灰心的想法",
"參加戶外的活動",
"保持生活的規律"
],

answer:0
},
{
text:`有一首歌，歌名叫「煩」，已流行一段時間，其中有二句是「煩
到無法呼吸，煩到沒有力氣」，話說回來，人生真的這麼煩嗎？事實
上，每個人都有煩惱，可是為什麼我們的腦袋裡裝了那麼多煩惱？那
是因為我們把事情看得太嚴重了，如果我們都能以平常心去看事情，
去接受這個世界的好與壞，我們就會發現煩惱並沒有什麼了不起。
<br></br>
解決煩惱的第一步，就是消除一切消極的想法，把不安、抱怨、
不樂觀、不感興趣、後悔、無信心、緊張、灰心等想法全部丟到腦外，
不要去想它；第二是積極參加各式各樣的戶外活動，例如登山、郊外
旅遊、攝影、露營、看球賽、游泳、看電影等，多和別人聊天，向朋
友訴說心事，聽聽別人意見；最後則是維持正常的生活時間表，讓生
活規律，並且多利用時間運動，保持充分的體力與活力。
<br></br>
有一句話說「天塌下來，都有人撐著」，就是告訴我們不要自己
尋找煩惱，不管發生什麼事，都一定有辦法度過，讓自己過得快樂一
點兒比較重要。

<br></br>
<b>作者最後說了什麼？</b>
`,

options:[
"幫助別人等於幫助自己",
"隨時都要做好預防災害的準備",
"人們無法預先知道將發生什麼事",
"無論發生任何事情都有方法解決"
],

answer:3
},



]

function shuffle(array){
return array.sort(()=>Math.random()-0.5)
}

let questions=[]
let current=0
let score=0
let wrongList=[]
let userAnswers=[]
let bookmarked=[]
let lastPassage=""


function buildQuestions(){

let temp=[]

questionBank.forEach(item=>{

// PASSAGE TYPE
if(item.passage){

item.questions.forEach((q,i)=>{

temp.push({
passage:item.passage,
text:`(${i+1})`,
options:q.options,
answer:q.answer
})

})

}

// NORMAL QUESTION
else{

temp.push(item)

}

})

return temp
}

function startTest(){

questions=shuffle(buildQuestions()).slice(0,45)

current=0
score=0
wrongList=[]
userAnswers=[]

document.getElementById("result").innerHTML=""
document.getElementById("review").innerHTML=""
document.getElementById("nextBtn").style.display="block"

showQuestion()

}

function showQuestion(){

let q=questions[current]

let html=`
<div class="progress">
Question ${current+1} / ${questions.length}
</div>
`

let marked = bookmarked.includes(current)

html+=`
<button onclick="toggleBookmark()" class="bookmark-btn ${marked ? "active":""}">
⭐ Bookmark
</button>
`



if(q.passage){

let blankNumber = q.text.replace(/[()]/g,'')

let highlightedPassage = q.passage.replace(
`..${blankNumber}..`,
`<span class="active-blank">..${blankNumber}..</span>`
)

html+=`
<div class="passage">
${highlightedPassage}
</div>
`

}

if(q.image){

html+=`<img src="${q.image}" class="question-image">`

}

if(q.passage){

let blankNumber = q.text.replace(/[()]/g,'')

html+=`
<div class="question">
<b>請選擇填入第 ${blankNumber} 個空格最適合的答案</b>
</div>
`

}

html+=`
<div class="question">
${q.text || ""}
</div>
`

q.options.forEach((opt,i)=>{

html+=`
<label class="option">
<input type="radio" name="answer" value="${i}">
${opt}
</label>
`

})

document.getElementById("quiz").innerHTML=html

}

document.getElementById("nextBtn").addEventListener("click",nextQuestion)

function nextQuestion(){

let selected=document.querySelector('input[name="answer"]:checked')

if(!selected){
alert("Pilih jawaban dulu!")
return
}

let ans=parseInt(selected.value)

userAnswers.push(ans)

if(ans===questions[current].answer){

score++

}else{

wrongList.push(current)

}

current++

if(current<questions.length){

showQuestion()


}else{

finish()

}

}
//TOGGLE
function toggleBookmark(){

if(bookmarked.includes(current)){

bookmarked = bookmarked.filter(i => i !== current)

}else{

bookmarked.push(current)

}
//show questionnnn
showQuestion()

}

function finish(){

document.getElementById("quiz").innerHTML=""

document.getElementById("nextBtn").style.display="none"

let html=`

<h2>Test Finished 🎉</h2>

Score: ${score} / ${questions.length}

<br><br>

Bookmarked Questions: ${bookmarked.length}

<br><br>

<button onclick="reviewWrong()">Review Wrong</button>

<button onclick="reviewBookmark()">Review Bookmark</button>

<button onclick="startTest()">Retry Test</button>

`


document.getElementById("result").innerHTML=html

}

function reviewWrong(){

let html=`

<h2>Review Wrong Answers</h2>

<button onclick="backToResult()" class="back-btn">
← Back to Result
</button>

`

wrongList.forEach(index=>{

let q=questions[index]
let user=userAnswers[index]

html+=`<div class="review-question">`

if(q.passage){

let blankNumber = q.text.replace(/[()]/g,'')

let pattern = new RegExp(`\\.\\.${blankNumber}\\.\\.`, "g")

let highlightedPassage = q.passage.replace(
pattern,
`<span class="active-blank">..${blankNumber}..</span>`
)

if(q.passage !== lastPassage){

html+=`
<div class="passage">
${highlightedPassage}
</div>
`

lastPassage = q.passage

}else{

html+=`
<div class="passage">
${highlightedPassage}
</div>
`

}

}

if(q.image){

html+=`<img src="${q.image}" class="question-image">`

}

html+=`<div class="question">${q.text || ""}</div>`

q.options.forEach((opt,i)=>{

let className="option"


if(i===q.answer){
className+=" correct"
}

if(i===user && user!==q.answer){
className+=" wrong"
}

html+=`<div class="${className}">${opt}</div>`

})

if(q.explanation){
html+=`
<div class="explanation">
Explanation: ${q.explanation}
</div>
`
}

html+="</div>"

})

document.getElementById("review").innerHTML=html

}
function reviewBookmark(){

let html=`

<h2>Bookmarked Questions</h2>

<button onclick="backToResult()" class="back-btn">
← Back to Result
</button>

`

bookmarked.forEach(index=>{

let q=questions[index]

html+=`<div class="review-question">`

if(q.passage){
html+=`<div class="passage">${q.passage}</div>`
}

if(q.image){
html+=`<img src="${q.image}" class="question-image">`
}

html+=`<div class="question">${q.text || ""}</div>`

q.options.forEach((opt,i)=>{

let className="option"

if(i===q.answer){
className+=" correct"
}

html+=`<div class="${className}">${opt}</div>`

})

html+="</div>"

})

document.getElementById("review").innerHTML=html

}

function backToResult(){

document.getElementById("review").innerHTML=""

}



startTest()